# -*- org-export-babel-evaluate: nil -*-

** Problem 1.7.1
#+BEGIN_QUOTE
my_filter(L, num)
input: list of numbers and a positive integer.
output: list of numbers not containing a multiple of num.
example: given list = [1,2,4,5,7] and num = 2, return [1,5,7].
#+END_QUOTE

#+BEGIN_SRC python :session *pyvenv*
def my_filter(L, num):
    return [ n for n in L if n % num != 0]

my_filter([1, 2, 4, 5, 7], 2)
#+END_SRC

#+results:
| 1 | 5 | 7 |

